
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>키워드 정리 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="arrays.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    README
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About Me</li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <a target="_blank" href="https://github.com/Kirade">
            
                    
                    Github
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <a target="_blank" href="https://www.linkedin.com/in/kirade/">
            
                    
                    LinkedIn
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Thoughts</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../../thoughts/undefined.html">
            
                <a href="../../thoughts/undefined.html">
            
                    
                    파이썬 시니어 개발자
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About This Blog</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../../about-this-blog/undefined.html">
            
                <a href="../../about-this-blog/undefined.html">
            
                    
                    기술 스택
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../../about-this-blog/undefined-1.html">
            
                <a href="../../about-this-blog/undefined-1.html">
            
                    
                    튜토리얼
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">PIECE OF KNOWLEDGE</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../java/">
            
                <a href="../java/">
            
                    
                    Java
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="5.1.1" data-path="../java/boxing.html">
            
                <a href="../java/boxing.html">
            
                    
                    Boxing
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="./">
            
                <a href="./">
            
                    
                    Kotlin
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="5.2.1" data-path="arrays.html">
            
                <a href="arrays.html">
            
                    
                    Arrays
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.2.2" data-path="undefined.html">
            
                <a href="undefined.html">
            
                    
                    키워드 정리
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >키워드 정리</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xD0A4;&#xC6CC;&#xB4DC;-&#xC815;&#xB9AC;">&#xD0A4;&#xC6CC;&#xB4DC; &#xC815;&#xB9AC;</h1>
<h2 id="java">Java</h2>
<p>&#xB9C9;&#xC0C1; Kotlin &#xC744; &#xC54C;&#xC544;&#xBCF4;&#xB824;&#xACE0; &#xC2DC;&#xC791;&#xC744; &#xD558;&#xB2C8; Java &#xC5D0; &#xB300;&#xD55C; &#xC774;&#xD574;&#xAC00; &#xBA3C;&#xC800; &#xD544;&#xC694;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xB300;&#xD559; &#xC218;&#xC5C5;&#xC73C;&#xB85C; &#xB4E4;&#xC5C8;&#xB358; &#xB0B4;&#xC6A9;&#xB4E4;&#xC744; &#xD558;&#xB098;&#xC529; &#xB354;&#xB4EC;&#xC73C;&#xBA74;&#xC11C; &#xD0A4;&#xC6CC;&#xB4DC; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="jdk">JDK</h3>
<p>Java Development Kit &#xC758; &#xC57D;&#xC790;&#xB85C; Java &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB85C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xB370; &#xD544;&#xC694;&#xD55C; &#xB3C4;&#xAD6C;&#xC640; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB4E4;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xAC1C;&#xBC1C; &#xD658;&#xACBD;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC548;&#xC5D0;&#xB294; Java &#xC218;&#xC5C5;&#xC744; &#xB4E4;&#xC73C;&#xBA74;&#xC11C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC558;&#xB358; Java &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;, &#xB514;&#xBC84;&#xAC70; &#xB4F1;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; JDK &#xB294; &#xBC84;&#xC804;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xBC84;&#xC804;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xB2A5;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xAC70;&#xB098;, &#xC131;&#xB2A5; &#xD639;&#xC740; &#xBCF4;&#xC548;&#xC131;&#xACFC; &#xAC19;&#xC740; &#xBD80;&#xBD84;&#xC774; &#xBCC0;&#xACBD;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>JDK &#xC5D0; &#xBC84;&#xC804;&#xC774; &#xC788;&#xB2E4;&#xBA74; Java &#xC5B8;&#xC5B4; &#xC790;&#xCCB4;&#xC5D0;&#xB3C4; &#xBC84;&#xC804;&#xC774; &#xC788;&#xC744;&#xAE4C;? &#xD558;&#xB294; &#xAD81;&#xAE08;&#xC99D;&#xC774; &#xB4E4;&#xC5C8;&#xACE0; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2C8; Java &#xB3C4; JDK &#xC640; &#xBCC4;&#xAC1C;&#xC758; &#xBC84;&#xC804;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xAC83;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD558;&#xACA0;&#xC9C0;&#xB9CC; Java &#xC5B8;&#xC5B4;&#xC758; &#xBC84;&#xC804;&#xACFC; JDK &#xC758; &#xBC84;&#xC804; &#xC0AC;&#xC774;&#xC758; &#xC758;&#xC874;&#xC131;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Java &#xC758; 8&#xBC84;&#xC804;&#xC740; JDK 8 &#xBC84;&#xC804;&#xACFC; &#xAC19;&#xC774; &#xCD9C;&#xC2DC;&#xB418;&#xC5B4;&#xC11C; Java &#xC758; &#xBC84;&#xC804;&#xACFC; JDK &#xC758; &#xBC84;&#xC804;&#xC774; &#xBCF4;&#xD1B5; &#xAC19;&#xAC8C; &#xC720;&#xC9C0;&#xB418;&#xB294;&#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; Java &#xC640; JDK &#xC758; &#xBC84;&#xC804;&#xC744; &#xD63C;&#xC6A9;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xB294;&#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="jre">JRE</h3>
<p>JRE &#xB294; Java Runtime Evironment &#xC758; &#xC57D;&#xC790;&#xB85C; &#xC704;&#xC758; JDK &#xC758; &#xC77C;&#xBD80;&#xB85C;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xACE0; JVM, Java &#xD074;&#xB798;&#xC2A4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC815;&#xB3C4;&#xAC00; &#xC774;&#xAC83;&#xC5D0; &#xD3EC;&#xD568;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="jar">JAR</h3>
<p>JAR &#xD30C;&#xC77C; &#xC774;&#xB77C;&#xACE0; &#xD558;&#xB294;&#xAC83;&#xC744; &#xC885;&#xC885; &#xBCF4;&#xAC8C;&#xB418;&#xB294;&#xB370;&#xC694;. Java &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD074;&#xB798;&#xC2A4; &#xADF8;&#xB9AC;&#xACE0; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; JAR &#xD30C;&#xC77C;&#xB85C; &#xD328;&#xD0A4;&#xC9D5;&#xB418;&#xC5B4; &#xBC30;&#xD3EC;&#xC2DC; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="spring">Spring</h2>
<p>Java &#xB85C; &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xAC1C;&#xBC1C;&#xD55C;&#xB2E4;&#xBA74; Spring &#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xACE0; &#xC720;&#xBA85;&#xD55C;&#xAC83;&#xC73C;&#xB85C; &#xC54C;&#xACE0;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Spring &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xB458;&#xB7EC;&#xBCF4;&#xB2C8; Microservices, Reactive, Cloud, Web apps, Serverless, Event Driven, Batch &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xACE0; &#xC18C;&#xAC1C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="spring-boot">Spring Boot</h3>
<p>Spring &#xACFC; &#xC774;&#xB984;&#xC774; &#xBE44;&#xC2B7;&#xD574;&#xC11C; &#xD56D;&#xC0C1; &#xAD81;&#xAE08;&#xD588;&#xC5C8;&#xB294;&#xB370;, Spring Boot &#xB294; Spring &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC870;&#xAE08; &#xB354; &#xAC04;&#xD3B8;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB3C4;&#xAD6C; &#xC815;&#xB3C4;&#xB85C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Spring Boot &#xC5D0;&#xC11C;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; Spring &#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC124;&#xC815;&#xD574;&#xC57C;&#xD558;&#xB294;&#xAC83;&#xB4E4; &#xC900;&#xBE44;&#xD574;&#xC57C;&#xD558;&#xB294; &#xAC83;&#xB4E4;&#xC744; &#xB300;&#xBD80;&#xBD84; Bootstraping &#xC744; &#xD574;&#xC8FC;&#xC5B4; &#xAC00;&#xBCCD;&#xAC8C; &#xAC1C;&#xBC1C;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAC8C; &#xD574;&#xC900;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xC138;&#xC138;&#xD55C; &#xC124;&#xC815;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xCEE8;&#xD2B8;&#xB864; &#xD558;&#xACE0;&#xC2F6;&#xC740; &#xACBD;&#xC6B0; Spring Boot &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC2DC;&#xC791;&#xD55C;&#xB2E4;&#xACE0;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="gradle-maven">Gradle, Maven</h3>
<p>Java &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC; &#xBC0F; &#xBE4C;&#xB4DC; &#xC790;&#xB3D9;&#xD654;&#xB97C; &#xC704;&#xD55C; &#xB3C4;&#xAD6C;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC790;&#xBC14;&#xC5D0;&#xC11C;&#xB3C4; &#xB2E4;&#xC591;&#xD55C; &#xC758;&#xC874;&#xC131;&#xB4E4;&#xC774; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xC5BD;&#xD600;&#xC788;&#xACE0; &#xC774;&#xAC83;&#xB4E4;&#xC744; &#xC798; &#xAD00;&#xB9AC;&#xD574;&#xC8FC;&#xB294; &#xB3C4;&#xAD6C;&#xC778;&#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE4C;&#xB4DC; &#xC790;&#xB3D9;&#xD654;&#xC758; &#xAC1C;&#xB150;&#xC740; &#xC870;&#xAE08; &#xC0DD;&#xC18C;&#xD588;&#xB294;&#xB370;&#xC694; Java &#xAC00; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xB2E4;&#xB978; &#xCEF4;&#xD30C;&#xC77C;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC5B8;&#xC5B4;&#xC774;&#xACE0; &#xC774;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xBD80;&#xAC00;&#xC791;&#xC5C5;&#xB4E4;&#xC774; &#xD544;&#xC694;&#xD574;&#xC11C; &#xC9C0;&#xC6D0;&#xD574;&#xC8FC;&#xB294; &#xD234; &#xC815;&#xB3C4;&#xAC00; &#xC544;&#xB2D0;&#xAE4C; &#xD558;&#xACE0; &#xAC00;&#xBCCD;&#xAC8C; &#xC774;&#xD574;&#xD558;&#xACE0; &#xB118;&#xC5B4;&#xAC14;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="jpa">JPA</h3>
<p>&#xC790;&#xBC14;&#xC758; &#xD45C;&#xC900; ORM &#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xC7A5;&#xACE0; ORM, SQLAlchemy &#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xAC1C;&#xB150;&#xC774;&#xC9C0; &#xC54A;&#xC744;&#xAE4C; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; Hibernate &#xB77C;&#xB294; JPA &#xC758; &#xAD6C;&#xD604;&#xCCB4;&#xC911;&#xC758; &#xD558;&#xB098;&#xB97C; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="arrays.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Arrays">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"키워드 정리","level":"5.2.2","depth":2,"previous":{"title":"Arrays","level":"5.2.1","depth":2,"path":"piece-of-knowledge/kotlin/arrays.md","ref":"piece-of-knowledge/kotlin/arrays.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"}},"file":{"path":"piece-of-knowledge/kotlin/undefined.md","mtime":"2026-01-06T14:07:30.650Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2026-01-06T14:07:59.720Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

