
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>튜토리얼 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../piece-of-knowledge/kotlin.html" />
    
    
    <link rel="prev" href="undefined.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    README
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About Me</li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <a target="_blank" href="https://github.com/Kirade">
            
                    
                    Github
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <a target="_blank" href="https://www.linkedin.com/in/kirade/">
            
                    
                    LinkedIn
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Thoughts</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../thoughts/undefined.html">
            
                <a href="../thoughts/undefined.html">
            
                    
                    파이썬 시니어 개발자
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About This Blog</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="undefined.html">
            
                <a href="undefined.html">
            
                    
                    기술 스택
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.2" data-path="undefined-1.html">
            
                <a href="undefined-1.html">
            
                    
                    튜토리얼
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">PIECE OF KNOWLEDGE</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../piece-of-knowledge/kotlin.html">
            
                <a href="../piece-of-knowledge/kotlin.html">
            
                    
                    Kotlin
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >튜토리얼</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;">&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;</h1>
<h3 id="0-&#xC900;&#xBE44;&#xBB3C;-">0. &#xC900;&#xBE44;&#xBB3C; </h3>
<p>&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; &#xC9C4;&#xD589;&#xC744; &#xC704;&#xD574;&#xC11C;&#xB294; Github, Gitbook &#xACC4;&#xC815;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xAE30;&#xC874;&#xC5D0; &#xAC00;&#xC785;&#xB41C; &#xACC4;&#xC815;&#xC774; &#xC5C6;&#xB294;&#xACBD;&#xC6B0; &#xB9E4;&#xB044;&#xB7EC;&#xC6B4; &#xC9C4;&#xD589;&#xC744; &#xC704;&#xD574; &#xAC00;&#xC785;&#xD6C4; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294;&#xAC83;&#xC744; &#xAD8C;&#xC7A5;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-github-&#xC800;&#xC7A5;&#xC18C;-&#xC0DD;&#xC131;">1. Github &#xC800;&#xC7A5;&#xC18C; &#xC0DD;&#xC131;</h3>
<p>&#xAC00;&#xC7A5; &#xCCAB; &#xB2E8;&#xACC4;&#xB294; Gitbook &#xC758; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xAD00;&#xD558;&#xACE0; Github Pages &#xB97C; &#xD638;&#xC2A4;&#xD305; &#xD560; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xC77C;&#xC785;&#xB2C8;&#xB2E4;. Github &#xC5D0;&#xC11C; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xD558;&#xB098; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; <code>kirade.github.io.sample</code> &#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-gitbook--github-&#xC800;&#xC7A5;&#xC18C;-&#xC5F0;&#xB3D9;">2. Gitbook &amp; Github &#xC800;&#xC7A5;&#xC18C; &#xC5F0;&#xB3D9;</h3>
<h4 id="space-&#xC0DD;&#xC131;">Space &#xC0DD;&#xC131;</h4>
<p>Gitbook &#xC5D0; &#xB85C;&#xADF8;&#xC778; &#xD558;&#xC5EC; &#xBE14;&#xB85C;&#xADF8;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xAD00;&#xB9AC;&#xD560; Space &#xB97C; &#xC2E0;&#xADDC;&#xB85C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC2E0;&#xADDC;&#xB85C; &#xC0DD;&#xC131;&#xD55C; Space &#xB294; &#xC55E;&#xC73C;&#xB85C; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC08; &#xCEE8;&#xD150;&#xCE20;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xACF5;&#xAC04;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h4 id="github-&#xB3D9;&#xAE30;&#xD654;">Github &#xB3D9;&#xAE30;&#xD654;</h4>
<p>&#xC0DD;&#xC131;&#xB41C; Space &#xC5D0; &#xC9C4;&#xC785;&#xD55C; &#xB4A4;, &#xC6B0;&#xCE21; &#xC0C1;&#xB2E8;&#xC758; &#xBA54;&#xB274;&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xC5EC; <code>Synchronize with Git</code> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC744; &#xD1B5;&#xD574; &#xBBF8;&#xB9AC; &#xB9CC;&#xB4E4;&#xC5B4;&#xB454; Github &#xC758; &#xC800;&#xC7A5;&#xC18C;&#xC640; Gitbook &#xC744; &#xC5F0;&#xB3D9;&#xD558;&#xAC8C;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xC120;&#xD0DD;&#xD654;&#xBA74;&#xC5D0;&#xC11C; Github &#xC744; &#xC120;&#xD0DD;&#xD558;&#xACE0; <code>Connect with GitHub</code> &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xC5F0;&#xB3D9;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. Github &#xACC4;&#xC815;&#xC5D0; &#xB85C;&#xADF8;&#xC778;&#xD558;&#xC5EC; Gitbook &#xC5D0; &#xC5F0;&#xB3D9;&#xC744; &#xC704;&#xD55C; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE58;&#xAC8C;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5F0;&#xB3D9; &#xC774;&#xD6C4;&#xC5D0; &#xB2E4;&#xC2DC; Gitbook &#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xBA74; &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xC704;&#xD574; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xB3D9;&#xAE30;&#xD654; &#xC635;&#xC158;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xBAA9;&#xB85D;&#xC774; &#xD45C;&#xAE30;&#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Select Repository<ul>
<li>1&#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Select Branch<ul>
<li>&#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xCC98;&#xC74C; &#xC0DD;&#xC131; &#xD55C; &#xB4A4;&#xC5D0; &#xC544;&#xBB34;&#xB7F0; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC800;&#xC7A5;&#xC18C;&#xB294; &#xC544;&#xBB34;&#xB7F0; &#xBE0C;&#xB79C;&#xCE58;&#xAC00; &#xC5C6;&#xB294; &#xC0C1;&#xD0DC;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC635;&#xC158; &#xCE78;&#xC5D0; <code>master</code> &#xB97C; &#xC9C1;&#xC811; &#xC785;&#xB825;&#xD574;&#xC8FC;&#xC5B4; master &#xBE0C;&#xB79C;&#xCE58;&#xB97C; &#xB3D9;&#xAE30;&#xD654; &#xC2DC;&#xC810;&#xC5D0; &#xC0DD;&#xC131;&#xB420; &#xC218; &#xC788;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Monorepo, Commit message, Fork Pull-Request Preview<ul>
<li>&#xC120;&#xD0DD;&#xC801;&#xC778; &#xC635;&#xC158;&#xC785;&#xB2C8;&#xB2E4;. &#xC124;&#xBA85;&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xACE0; &#xC120;&#xD0DD;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Choose priority<ul>
<li>Github &#xACFC; Gitbook &#xC0AC;&#xC774;&#xC758; &#xB3D9;&#xAE30;&#xD654;&#xC758; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xB97C; &#xC815;&#xD558;&#xB294; &#xC635;&#xC158;&#xC785;&#xB2C8;&#xB2E4;. Gitbook &#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xC8FC;&#xB85C; &#xD560; &#xC608;&#xC815;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>Gitbook to Github</code> &#xC635;&#xC158;&#xC744; &#xCCB4;&#xD06C;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#xBAA8;&#xB4E0; &#xC124;&#xC815;&#xC774; &#xB05D;&#xB0AC;&#xC73C;&#xBA74; <code>Synchronize</code> &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. Github &#xC800;&#xC7A5;&#xC18C;&#xC758; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB3C4; &#xD568;&#xAED8; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xAE30;&#xD654; &#xB41C; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; Gitbook &#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; &#xBCC0;&#xACBD;&#xC0AC;&#xD56D;&#xC740; Github &#xC5D0; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-github-workflow-&#xC124;&#xC815;">3. Github Workflow &#xC124;&#xC815;</h3>
<h4 id="master-gh-pages-&#xC758;-&#xC5ED;&#xD560;">master, gh-pages &#xC758; &#xC5ED;&#xD560;</h4>
<p>master &#xBE0C;&#xB79C;&#xCE58;&#xC5D0; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xB3D9;&#xAE30;&#xD654; &#xB418;&#xACE0; &#xC788;&#xB294; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB294; Gitbook &#xC5D0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xCEE8;&#xD150;&#xCE20;&#xC758; &#xB0B4;&#xC6A9;&#xB9CC; &#xBCF4;&#xAD00;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; master &#xBE0C;&#xB79C;&#xCE58;&#xC758; &#xB0B4;&#xC6A9;&#xC744; Github Pages &#xAE30;&#xB2A5;&#xC744; &#xD1B5;&#xD574; &#xB80C;&#xB354;&#xB9C1; &#xD574;&#xB3C4; &#xC791;&#xC131;&#xB41C; &#xB0B4;&#xC6A9;&#xB9CC; &#xBCF4;&#xC77C; &#xBFD0; &#xBCF4;&#xAE30;&#xC88B;&#xC740; Gitbook &#xC758; UI &#xB294; &#xD568;&#xAED8; &#xB80C;&#xB354;&#xB9C1; &#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Gitbook &#xC758; &#xD615;&#xD0DC;&#xB97C; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xB80C;&#xB354;&#xB9C1;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; Gitbook &#xC744; &#xBE4C;&#xB4DC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC5D0;&#xC11C;&#xB294; &#xBE4C;&#xB4DC; &#xACFC;&#xC815;&#xC744; &#xC790;&#xB3D9;&#xD654; &#xD558;&#xAE30;&#xC704;&#xD574; <a href="https://github.com/marketplace/actions/publish-gitbook" target="_blank">&#xC774;&#xAC83;</a>&#xC744; &#xD65C;&#xC6A9;&#xD560; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC561;&#xC158;&#xC740; Gitbook &#xC758; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xAD00;&#xD558;&#xACE0; &#xC788;&#xB294; master &#xBE0C;&#xB79C;&#xCE58;&#xB85C;&#xBD80;&#xD130; &#xBE4C;&#xB4DC;&#xB97C; &#xC9C4;&#xD589;&#xD574;&#xC11C; gh-pages &#xBE0C;&#xB79C;&#xCE58;&#xC5D0; &#xBE4C;&#xB4DC;&#xB41C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xC5C5;&#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="&#xC800;&#xC7A5;&#xC18C;-&#xAD8C;&#xD55C;-&#xC124;&#xC815;-&#xBCC0;&#xACBD;">&#xC800;&#xC7A5;&#xC18C; &#xAD8C;&#xD55C; &#xC124;&#xC815; &#xBCC0;&#xACBD;</h4>
<p>&#xBE4C;&#xB4DC; &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xC815;&#xC758;&#xD558;&#xAE30; &#xC774;&#xC804;&#xC5D0; &#xC800;&#xC7A5;&#xC18C;&#xC758; &#xC77C;&#xBD80; &#xAD8C;&#xD55C; &#xC124;&#xC815;&#xC744; &#xBCC0;&#xACBD;&#xD574; &#xC8FC;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xCD5C;&#xCD08;&#xC5D0; &#xB3D9;&#xC791;&#xD560; &#xB54C; gh-pages &#xBE0C;&#xB79C;&#xCE58;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB824;&#xACE0; &#xD558;&#xB294;&#xB370; &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xD544;&#xC694;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xC7A5;&#xC18C;&#xC758; Settings - Actions - General &#xC5D0; &#xC9C4;&#xC785;&#xD558;&#xC5EC; &#xD558;&#xB2E8;&#xC758; Workflow permissions &#xC5D0;&#xC11C; Read and write permissions &#xC5D0; &#xCCB4;&#xD06C;&#xD55C; &#xB4A4; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="&#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;-&#xC0DD;&#xC131;">&#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0; &#xC0DD;&#xC131;</h4>
<p>&#xC704;&#xC758; &#xAD8C;&#xD55C; &#xC124;&#xC815;&#xC774; &#xC9C4;&#xD589;&#xB41C; &#xC774;&#xD6C4;  master &#xBE0C;&#xB79C;&#xCE58;&#xC758; <code>.github/workflows/build.yml</code> &#xC774;&#xB77C;&#xB294; &#xD30C;&#xC77C;&#xBA85;&#xC73C;&#xB85C; &#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB97C; &#xCD94;&#xAC00;&#xD569;&#xB2C8;&#xB2E4;. master &#xBE0C;&#xB79C;&#xCE58;&#xC758; push &#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xACBD;&#xC6B0; Gitbook &#xC758; &#xBE4C;&#xB4DC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xC561;&#xC158;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-yaml"><span class="hljs-attr">on:</span>
<span class="hljs-attr">  push:</span>
<span class="hljs-attr">    branches:</span>
<span class="hljs-bullet">      -</span> <span class="hljs-string">&apos;master&apos;</span>


<span class="hljs-attr">jobs:</span>
<span class="hljs-attr">  build:</span>
<span class="hljs-attr">    name:</span> Build Gitbook
<span class="hljs-attr">    runs-on:</span> ubuntu-latest
<span class="hljs-attr">    steps:</span>
<span class="hljs-attr">      - name:</span> Checkout
<span class="hljs-attr">        uses:</span> actions/checkout@v2

<span class="hljs-attr">      - name:</span> Build Gitbook
<span class="hljs-attr">        uses:</span> tuliren/publish-gitbook@v1<span class="hljs-number">.0</span><span class="hljs-number">.1</span>
<span class="hljs-attr">        with:</span>
<span class="hljs-attr">          github_token:</span> ${{ secrets.GITHUB_TOKEN }}
</code></pre>
<p>&#xC704;&#xC758; &#xC124;&#xC815;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xACE0; &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xD655;&#xC778;&#xD558;&#xBA74; &#xBE4C;&#xB4DC;&#xAC00; &#xC9C4;&#xD589;&#xB418;&#xB294;&#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE4C;&#xB4DC;&#xAC00; &#xC644;&#xB8CC; &#xB418;&#xC5C8;&#xB2E4;&#xBA74;, &#xC800;&#xC7A5;&#xC18C;&#xC5D0;&#xB294; gh-pages &#xB77C;&#xB294; &#xBE0C;&#xB79C;&#xCE58;&#xB3C4; &#xC2E0;&#xADDC;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xC774; &#xBE0C;&#xB79C;&#xCE58; &#xC548;&#xC5D0;&#xC11C;&#xB294; &#xBE4C;&#xB4DC;&#xB41C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="4-github-pages-&#xC124;&#xC815;">4. Github Pages &#xC124;&#xC815;</h3>
<p>&#xBAA8;&#xB4E0; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB294; &#xC900;&#xBE44;&#xB418;&#xC5C8;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; Github Pages &#xB97C; &#xC124;&#xC815;&#xD558;&#xB294; &#xC77C;&#xB9CC; &#xB0A8;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xC7A5;&#xC18C;&#xC758; Settings - Pages &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Source<ul>
<li>Deploy from a branch</li>
</ul>
</li>
<li>Branch<ul>
<li>gh-pages &#xBE0C;&#xB79C;&#xCE58;</li>
<li>/ (root)</li>
</ul>
</li>
</ul>
<p>&#xC800;&#xC7A5;&#xD558;&#xAC8C;&#xB418;&#xBA74; &#xC0AC;&#xC774;&#xD2B8;&#xAC00; &#xBC30;&#xD3EC;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xBB38;&#xAD6C;&#xAC00; &#xC124;&#xC815;&#xD398;&#xC774;&#xC9C0; &#xC0C1;&#xB2E8;&#xC5D0; &#xD45C;&#xAE30;&#xB429;&#xB2C8;&#xB2E4;. &#xD45C;&#xAE30;&#xB418;&#xB294; &#xC0AC;&#xC774;&#xD2B8;&#xC758; &#xC8FC;&#xC18C;&#xB85C; &#xC811;&#xC18D;&#xD558;&#xAC8C;&#xB418;&#xBA74; Gitbook &#xC758; &#xB0B4;&#xC6A9;&#xC774; &#xBCF4;&#xC5EC;&#xC9C0;&#xB294;&#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xAC83;&#xC73C;&#xB85C; Gitbook &amp; Github Pages &#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xBE14;&#xB85C;&#xADF8;&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xC791;&#xC5C5;&#xC740; &#xB05D;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C;&#xB294; Gitbook &#xC744; &#xD1B5;&#xD574; &#xAE00;&#xC744;&#xC791;&#xC131;&#xD558;&#xAE30;&#xB9CC;&#xD558;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD638;&#xC2A4;&#xD305;&#xC911;&#xC778; Github Pages &#xC5D0; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBC30;&#xD3EC;&#xAC00; &#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-&#xBD80;&#xB85D;">5. &#xBD80;&#xB85D;</h3>
<p><strong>.nojekyll &#xD30C;&#xC77C;</strong></p>
<p>Github Pages &#xB97C; &#xD65C;&#xC6A9;&#xD560;&#xB54C; Deploy from a branch &#xC635;&#xC158;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; Jekyll &#xC744; &#xD65C;&#xC6A9;&#xD574;&#xC11C; &#xBE4C;&#xB4DC;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBE4C;&#xB4DC;&#xB41C; &#xD30C;&#xC77C;&#xB4E4; &#xC911; .(dot) &#xD639;&#xC740; _(underscore) &#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xD3F4;&#xB354;&#xB098; &#xD30C;&#xC77C;&#xC758; &#xACBD;&#xC6B0; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xBC30;&#xD3EC;&#xB418;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Gitbook &#xC740; .gitbook &#xC774;&#xB77C;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC548;&#xC5D0;&#xC11C; assets &#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; Jekyll &#xBE4C;&#xB4DC;&#xAC00; &#xC791;&#xB3D9;&#xD558;&#xAC8C; &#xB418;&#xBA74; assets &#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC774;&#xBBF8;&#xC9C0;&#xC640; &#xAC19;&#xC740; &#xD30C;&#xC77C;&#xB4E4;&#xC774; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xD45C;&#xAE30;&#xB418;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>.nokeyll</code> &#xD30C;&#xC77C;&#xC744; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB8E8;&#xD2B8;&#xC5D0; &#xCD94;&#xAC00;&#xC2DC;&#xCF1C;&#xC11C; Jekyll &#xBE4C;&#xB354;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xAC83;&#xC744; &#xAD8C;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. (<a href="https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages#static-site-generators" target="_blank">&#xAD00;&#xB828; &#xBB38;&#xC11C;</a>)</p>
<h3 id="&#xCC38;&#xACE0;">&#xCC38;&#xACE0;</h3>
<ul>
<li><a href="https://github.com/Kirade/kirade.github.io.sample" target="_blank">&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC744; &#xD1B5;&#xD574; &#xC0DD;&#xC131;&#xD55C; &#xC800;&#xC7A5;&#xC18C;</a></li>
<li><a href="https://pages.github.com/" target="_blank">Github Pages</a></li>
<li><a href="https://www.gitbook.com/" target="_blank">Gitbook</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="undefined.html" class="navigation navigation-prev " aria-label="Previous page: 기술 스택">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../piece-of-knowledge/kotlin.html" class="navigation navigation-next " aria-label="Next page: Kotlin">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"튜토리얼","level":"4.2","depth":1,"next":{"title":"Kotlin","level":"5.1","depth":1,"path":"piece-of-knowledge/kotlin.md","ref":"piece-of-knowledge/kotlin.md","articles":[]},"previous":{"title":"기술 스택","level":"4.1","depth":1,"path":"about-this-blog/undefined.md","ref":"about-this-blog/undefined.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"about-this-blog/undefined-1.md","mtime":"2024-04-08T14:38:11.589Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-04-08T14:38:41.596Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

