
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>파이썬 시니어 개발자 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../about-this-blog/undefined.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    README
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About Me</li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <a target="_blank" href="https://github.com/Kirade">
            
                    
                    Github
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <a target="_blank" href="https://www.linkedin.com/in/kirade/">
            
                    
                    LinkedIn
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Thoughts</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="undefined.html">
            
                <a href="undefined.html">
            
                    
                    파이썬 시니어 개발자
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">About This Blog</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../about-this-blog/undefined.html">
            
                <a href="../about-this-blog/undefined.html">
            
                    
                    기술 스택
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../about-this-blog/undefined-1.html">
            
                <a href="../about-this-blog/undefined-1.html">
            
                    
                    튜토리얼
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">PIECE OF KNOWLEDGE</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../piece-of-knowledge/kotlin.html">
            
                <a href="../piece-of-knowledge/kotlin.html">
            
                    
                    Kotlin
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >파이썬 시니어 개발자</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xD30C;&#xC774;&#xC36C;-&#xC2DC;&#xB2C8;&#xC5B4;-&#xAC1C;&#xBC1C;&#xC790;">&#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;</h1>
<p>&#xCD5C;&#xADFC;&#xC5D0; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790; &#xD3EC;&#xC9C0;&#xC158;&#xC744; &#xC5F4;&#xC5B4;&#xB450;&#xACE0; &#xBA74;&#xC811;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xD300;&#xC5D0; &#xC798; &#xB9DE;&#xB294; &#xBD84;&#xC744; &#xCC3E;&#xC9C0; &#xBABB;&#xD574; &#xC870;&#xAE08;&#xC529; &#xC9C0;&#xCCD0;&#xAC00;&#xB358;&#xCC28;&#xC5D0; &#xC6B0;&#xC5F0;&#xCC2E;&#xAC8C; SNS&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xCC44;&#xC6A9;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xD68C;&#xACE0; &#xAE00;&#xC744; &#xC77D;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE00;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xC694;&#xC57D;&#xD558;&#xBA74; &#xC774;&#xB807;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAC1C;&#xBC1C;&#xD574;&#xC628; &#xD68C;&#xC0AC;&#xAC00; &#xC798; &#xC131;&#xC7A5;&#xD558;&#xACE0; &#xC788;&#xB358; &#xC5B4;&#xB290; &#xC2DC;&#xC810;&#xC5D0; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xCC44;&#xC6A9;&#xD558;&#xB294;&#xAC83;&#xC5D0; &#xC5B4;&#xB824;&#xC6C0;&#xC774; &#xC788;&#xC5C8;&#xB358; &#xACBD;&#xD5D8;&#xC774; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB09C; &#xB4A4; &#xB2E4;&#xC2DC; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8; &#xB9CC;&#xC57D; &#xC801;&#xC808;&#xD55C; &#xC2DC;&#xC810;&#xC5D0; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xD480;&#xC774; &#xC6D4;&#xB4F1;&#xD788; &#xD070; JVM &#xAE30;&#xBC18; &#xC5B8;&#xC5B4;&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xAC70;&#xB098; &#xC5B4;&#xB290;&#xC815;&#xB3C4; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xACF5;&#xC874;&#xD558;&#xB294; &#xC2DC;&#xB3C4;&#xB97C; &#xD588;&#xB354;&#xB77C;&#xBA74; &#xB2F9;&#xC2DC;&#xC5D0; &#xD68C;&#xC0AC;&#xAC00; &#xACAA;&#xB358; &#xCC44;&#xC6A9;&#xC758; &#xC5B4;&#xB824;&#xC6C0;&#xC744; &#xC870;&#xAE08;&#xC740; &#xD574;&#xC18C;&#xD560; &#xC218; &#xC788;&#xC9C0; &#xC54A;&#xC558;&#xC744;&#xAE4C; &#xD558;&#xB294; &#xD68C;&#xACE0;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xB3C4; &#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xD300;&#xC6D0;&#xC73C;&#xB85C; &#xBF51;&#xC73C;&#xB824;&#xACE0; &#xB178;&#xB825;&#xD558;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xAF64;&#xB098; &#xACF5;&#xAC10;&#xC774; &#xAC00;&#xB294; &#xB0B4;&#xC6A9;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xD604;&#xC7AC;&#xB294; &#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xD480;&#xC774; JVM &#xC5D0; &#xBE44;&#xD574;&#xC11C; &#xC791;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCC44;&#xC6A9;&#xD558;&#xB294;&#xAC83;&#xC758; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB354; &#xB192;&#xC740;&#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC65C; &#xD30C;&#xC774;&#xC36C; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC22B;&#xC790;&#xB294; &#xC801;&#xC744;&#xAE4C; &#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC84C;&#xB294;&#xB370;&#xC694;. &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC131;&#xACF5;&#xC2DC;&#xD0A8; &#xACBD;&#xD5D8;&#xC774; &#xC788;&#xB294; &#xD68C;&#xC0AC;&#xAC00; &#xB9CE;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC131;&#xACF5;&#xC2DC;&#xD0A4;&#xAC8C; &#xB418;&#xBA74; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xC131;&#xACF5;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xB9CC;&#xB4E0; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xC2DC;&#xB2C8;&#xC5B4;&#xB85C; &#xC131;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC744;&#xD14C;&#xACE0;, &#xC88B;&#xC740; &#xC778;&#xB825;&#xB4E4;&#xC774; &#xBAB0;&#xB9AC;&#xBA70; &#xC88B;&#xC740; &#xACBD;&#xD5D8;&#xC744; &#xAC00;&#xC9C4; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xB9CE;&#xC544;&#xC9C0;&#xB294; &#xC120;&#xC21C;&#xD658;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xBA70; &#xCC44;&#xC6A9; &#xD480;&#xC774; &#xC131;&#xC7A5;&#xD574; &#xB098;&#xAC08;&#xAC83;&#xC774;&#xB77C; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xB2F9;&#xC7A5; &#xADF8;&#xB7F0; &#xC21C;&#xD658;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xAE30; &#xC774;&#xC804;&#xC5D0; &#xB2F9;&#xC7A5; &#xCC44;&#xC6A9;&#xC774; &#xD544;&#xC694;&#xD55C; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C;&#xB294; &#xACE0;&#xBBFC;&#xC774; &#xB9CE;&#xC544;&#xC9C8; &#xC218; &#xBC16;&#xC5D0; &#xC5C6;&#xC744;&#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xAC00; &#xC544;&#xB2CC; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xC5D0; &#xC219;&#xB828;&#xB41C; &#xC2DC;&#xB2C8;&#xC5B4;&#xB97C; &#xCC44;&#xC6A9;&#xD55C;&#xB2E4;&#xACE0; &#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACA0;&#xC9C0;&#xB9CC; &#xD68C;&#xC0AC;&#xC640; &#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790; &#xBAA8;&#xB450; &#xAF64;&#xB098; &#xB3C4;&#xC804;&#xC801;&#xC778; &#xACB0;&#xC815;&#xC774; &#xD544;&#xC694;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC27D;&#xC9C0; &#xC54A;&#xC740; &#xC120;&#xD0DD;&#xC774;&#xAE34; &#xD560; &#xAC83; &#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC640; &#xAD00;&#xB828;&#xD55C; &#xC0DD;&#xAC01;&#xB4E4;&#xC744; &#xD574;&#xBCF4;&#xACE0; &#xC788;&#xC73C;&#xB2C8; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0;&#xB294; &#xC81C;&#xAC00; &#xAF64;&#xB098; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xCE58;&#xC911;&#xB41C; &#xBC31;&#xC5D4;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xCEE4;&#xB9AC;&#xC5B4;&#xB97C; &#xC313;&#xC544;&#xAC00;&#xACE0; &#xC788;&#xB294;&#xAC83; &#xAC19;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC7AC;&#xBBF8;&#xC788;&#xC9C0;&#xB9CC; &#xD55C; &#xAC00;&#xC9C0; &#xC5B8;&#xC5B4;&#xC5D0; &#xC9D1;&#xC911;&#xD560; &#xC218;&#xB85D; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xB9C9;&#xC5F0;&#xD55C; &#xB450;&#xB824;&#xC6C0;&#xC774; &#xC0DD;&#xAE30;&#xAC70;&#xB098; &#xC2DC;&#xC57C;&#xAC00; &#xC881;&#xC544;&#xC9C0;&#xB294; &#xAC83;&#xC740; &#xACBD;&#xACC4;&#xD574;&#xC57C;&#xD560; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC55E;&#xC73C;&#xB85C;&#xB294; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="../about-this-blog/undefined.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 기술 스택">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"파이썬 시니어 개발자","level":"3.1","depth":1,"next":{"title":"기술 스택","level":"4.1","depth":1,"path":"about-this-blog/undefined.md","ref":"about-this-blog/undefined.md","articles":[]},"previous":{"title":"LinkedIn","level":"2.2","depth":1,"url":"https://www.linkedin.com/in/kirade/","ref":"https://www.linkedin.com/in/kirade/","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"thoughts/undefined.md","mtime":"2024-04-08T14:36:27.207Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-04-08T14:36:55.708Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

